{
  "id": "1pyxz90",
  "title": "🎙️ Episode 001: Christian Reed (Founder of REEKON Tools) | /r/Entrepreneur Podcast",
  "author": "FITGuard",
  "selftext": "Earlier this week, we announced the launch of the official r/Entrepreneur **AMA Podcast** in celebration of crossing **5 million subscribers**.\n\nToday, we’re sharing **Episode 1**.\n\nOur first guest is **Christian Reed**, founder of **REEKON Tools**.\n\nIf you’ve spent any time around hardware, construction, or product-led startups, there’s a good chance you’ve come across REEKON’s tools. In this conversation, we talk less about the polished end result and more about what it actually took to build a real, physical product business.\n\nWe get into things like:\n\n* Turning a personal pain point into a real company\n* What surprised him most about manufacturing and distribution\n* Why building hardware forces very different decisions than software\n* Mistakes that were expensive, but necessary\n\nThis episode is part of a 12-episode season designed as an **extension of the AMA format**, not a replacement for it.\n\nAs with every episode this season, **Christian will be back here for a live AMA** shortly after the release so the community can ask follow-up questions, push back, or dig into anything we didn’t cover.\n\n🎧 **Watch Episode 1 here:**  \n[Podcast Link](https://www.youtube.com/watch?v=f3S6RmVI87E)\n\nWe will have a SEPERATE thread to host the AMA\n\nMore episodes coming soon...\n\n  \n— The r/Entrepreneur Mod Team\n\nhosted u/FITGuard &amp; u/brndmkrs \\- (https://www.reddit.com/r/Entrepreneur/comments/12cnmwi/im\\_christopher\\_louie\\_a\\_former\\_movie\\_director\\_now/)",
  "score": 10,
  "num_comments": 20,
  "created_utc": 1767041948.0,
  "url": "https://www.youtube.com/watch?v=f3S6RmVI87E",
  "subreddit": "Entrepreneur",
  "upvote_ratio": 0.66,
  "comments": [
    {
      "id": "nwm2d84",
      "author": "FITGuard",
      "body": "Thanks to our guest u/reekontools \\- please provide good fellowship",
      "score": 1,
      "created_utc": 1767042245.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "nwm767r",
      "author": "ThrowbackGaming",
      "body": "Here's some constructive criticism just regarding the production. A couple of things I noticed just right off the bat is the camera angle and head spacing between the guest and the hosts are just way off.\n\n* The guest's head spacing is basically non-existent\n* The head spacing for the hosts is like one-third of empty space above their heads, which isn't bad, but it's just such a huge contrast between the host and the guest when you switch camera angles that it just throws me off.\n* The guest lower third comes in on the host's instead of the actual guest. So when it first came on, I thought it was a lower third for the host. But then I read below, and just contextually, I understood that it's for the guest. Ideally, the lower third should animate in when the guest is on the screen. \n* The general framing of the hosts is a bit odd; it skews more towards the left side of the frame. I'd like to see it more centered or positioned so that the guy in the tie and button-up shirt is more towards the right side of the frame. This way, it feels like you have a back and forth between the host and the guest when you switch camera angles. Right now, it just feels like there's some visual tension in the frame whenever the hosts are on camera because of how the framing is set up.\n* The set could also use some work. Right now, it's very much like a green screen type of background with the green drapes and green wall, and it doesn't feel like there's any separation really between the subject and the background.\n* I would suggest either repainting the walls or putting up some visual separation between the background and the foreground...maybe some plants or a table and desk with a lamp and various knickknacks on it. Then, maybe play around with the focus and the F-stop of the camera in general so it feels like there's a little bit more of a cinematic feel to the video.\n* Lighting overall feels harsh. Subject is very well-lit and the background is also well-lit, there should be some contrast so it doesn't feel equally well-lit. Maybe mess with the hair light and the back light.\n* Add a third roaming camera angle, maybe an over the shoulder angle as well.\n* There's a spelling mistake on the title sequence \"Offical\" instead of \"Official\".\n* Not going to comment on the entire videos narrative flow or anything like that, but I did notice that in the intro the host thanks the guest for being there, but doesn't allow a response and brute forces his way to the questions so the guest kind of interjects for a brief moment and looks kind of awkward. In the future either cut out the guests brief interjection altogether and don't cut to him with the camera, or give the guest space to respond.\n\nHope this wasn't too harsh! Just some quick things I noticed.",
      "score": 2,
      "created_utc": 1767043630.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": [
        {
          "id": "nwm9w75",
          "author": "FITGuard",
          "body": "Thanks so much for offering such specific and thoughtful insight. Our team will meet live and go threw these one by one. \n\nWe appreciate your thoughts!",
          "score": 2,
          "created_utc": 1767044420.0,
          "parent_id": "t1_nwm767r",
          "gilded": 0,
          "depth": 1,
          "replies": [
            {
              "id": "nwmm540",
              "author": "ThrowbackGaming",
              "body": "No problem! Cool idea for a podcast!",
              "score": 3,
              "created_utc": 1767048108.0,
              "parent_id": "t1_nwm9w75",
              "gilded": 0,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "nwma7li",
      "author": "DerAmadeus",
      "body": "Thank you and congrats! Will it be available on Apple Podcasts, Spotify, RSS etc too? Searched Apple Podcasts but haven’t been able to find it.",
      "score": 2,
      "created_utc": 1767044513.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": [
        {
          "id": "nwmah94",
          "author": "FITGuard",
          "body": "Yes, we were trying to upload to Reddit first, then the subsequent platforms. Since Reddit sponsored the production, we were trying to bottleneck the original release to be on reddit.",
          "score": 1,
          "created_utc": 1767044591.0,
          "parent_id": "t1_nwma7li",
          "gilded": 0,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "nwmmxis",
      "author": "enesccinar",
      "body": "Looking fw to see more",
      "score": 2,
      "created_utc": 1767048357.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "nwqd3h4",
      "author": "reekontools",
      "body": "thanks for having us on the show, look forward to continuing the conversation here!",
      "score": 2,
      "created_utc": 1767103645.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "nxws2ts",
      "author": "kriskeillor",
      "body": "Great first episode! Loved the energy of both the hosts and the guest, Mr. Reed. He seems like he is really \"with it\". I have a friend who works at his company. If the energy matches his vibe, I'm sure he's having a great time and learning an incredible amount. \n\n\nLooking forward to the next episode as well!",
      "score": 2,
      "created_utc": 1767655830.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "nwm6xqn",
      "author": "ChikenNoodlePoop",
      "body": "I’ve been waiting for this!!!",
      "score": 1,
      "created_utc": 1767043563.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ny5j7cd",
      "author": "[deleted]",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1767765473.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "o4lvuip",
      "author": "Otherwise_Flan7339",
      "body": "Interesting to hear about a physical product company. I'm building an AI agent platform for sales teams. Totally different world from manufacturing.  \n  \nWe built our first agent prototype in 4 days. Cost us $30 in OpenAI API calls. Getting to that first functional version is fast with software.  \n  \nBut then scaling it and getting \\*real\\* sales is where the tough stuff starts. We have 1 paying customer right now, ARR is $500. Not much. My cost is mostly cloud infra and dev time.  \n  \nCurious to hear about Christian's expensive mistakes. For us, a 'mistake' might be burning dev time on a feature no one wants. Or bad prompt engineering costing us a lot in API calls for low-quality output. It's not a physical product sitting in a warehouse.  \n  \nThe difference in fixed costs must be wild. For us, fixed costs are pretty low, mostly Vercel and Supabase subscriptions. Most of our costs scale with usage.",
      "score": 1,
      "created_utc": 1770728490.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    },
    {
      "id": "o4mowvw",
      "author": "Inevitable-Earth1288",
      "body": "Love it! Thanks for discussing interesting questions. It wasn't boring like many other business podcasts. ",
      "score": 1,
      "created_utc": 1770737854.0,
      "parent_id": "t3_1pyxz90",
      "gilded": 0,
      "depth": 0,
      "replies": []
    }
  ]
}